apache/nuttx/arch/arm/src/stm32h7/stm32_ethernet.c
/****************************************************************************
 * arch/arm/src/stm32h7/stm32_ethernet.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <time.h>
#include <string.h>
#include <assert.h>
#include <nuttx/debug.h>
#include <syslog.h>
#include <errno.h>

#include <sys/param.h>

#include <arch/barriers.h>
#include <arpa/inet.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/queue.h>
#include <nuttx/wdog.h>
#include <nuttx/wqueue.h>
#include <nuttx/signal.h>
#include <nuttx/net/mii.h>
#include <nuttx/net/ip.h>
#include <nuttx/net/netdev.h>
#include <nuttx/crc64.h>

#if defined(CONFIG_NET_PKT)
#  include <nuttx/net/pkt.h>
#endif

#include <nuttx/cache.h>
#include "arm_internal.h"

#include "hardware/stm32_pinmap.h"
#include "stm32_gpio.h"

#ifdef CONFIG_STM32_HAVE_SBS
#  include "hardware/stm32h7rsxx_sbs.h"
#else
#  include "hardware/stm32_syscfg.h"
#endif

/* The PHY interface selection lives in SBS on the H7R/S and in SYSCFG
 * everywhere else.  Only the names differ.
 */

#ifdef CONFIG_STM32_HAVE_SBS
#  define ETH_PHYSEL_REG   STM32_SBS_PMCR
#  define ETH_PHYSEL_MASK  SBS_PMCR_ETH_PHYSEL_MASK
#  define ETH_PHYSEL_MII   SBS_PMCR_ETH_PHYSEL_GMII_MII
#  define ETH_PHYSEL_RMII  SBS_PMCR_ETH_PHYSEL_RMII
#else
#  define ETH_PHYSEL_REG   STM32_SYSCFG_PMC
#  define ETH_PHYSEL_MASK  SYSCFG_PMC_EPIS_MASK
#  define ETH_PHYSEL_MII   SYSCFG_PMC_EPIS_MII
#  define ETH_PHYSEL_RMII  SYSCFG_PMC_EPIS_RMII
#endif
#include "stm32_rcc.h"
#include "stm32_ethernet.h"
#include "stm32_uid.h"
#include "stm32_mdio.h"

#include <arch/board/board.h>

/* STM32_NETHERNET determines the number of physical interfaces that can
 * be supported by the hardware.  CONFIG_STM32_ETHMAC will defined if
 * any STM32H7 Ethernet support is enabled in the configuration.
 */

#if STM32_NETHERNET > 0 && defined(CONFIG_STM32_ETHMAC)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

#if STM32_NETHERNET > 1
#  error "Logic to support multiple Ethernet interfaces is incomplete"
#endif

/* If processing is not done at the interrupt level, then work queue support
 * is required.
 */

#if !defined(CONFIG_SCHED_WORKQUEUE)
#  error Work queue support is required
#else

/* Select work queue */

#  if defined(CONFIG_STM32_ETHMAC_HPWORK)
#    define ETHWORK HPWORK
#  elif defined(CONFIG_STM32_ETHMAC_LPWORK)
#    define ETHWORK LPWORK
#  else
#    define ETHWORK LPWORK
#  endif
#endif

#if defined(CONFIG_ETH0_PHY_AM79C874)
#  define STM32_PHYID1       MII_PHYID1_AM79C874
#  define STM32_PHYID2       MII_PHYID2_AM79C874
#elif defined(CONFIG_ETH0_PHY_AR8031)
#  define STM32_PHYID1       MII_PHYID1_AR8031
#  define STM32_PHYID2       MII_PHYID2_AR8031
#elif defined(CONFIG_ETH0_PHY_KS8721)
#  define STM32_PHYID1       MII_PHYID1_KS8721
#  define STM32_PHYID2       MII_PHYID2_KS8721
#elif defined(CONFIG_ETH0_PHY_KSZ8041)
#  define STM32_PHYID1       MII_PHYID1_KSZ8041
#  define STM32_PHYID2       MII_PHYID2_KSZ8041
#elif defined(CONFIG_ETH0_PHY_KSZ8051)
#  define STM32_PHYID1       MII_PHYID1_KSZ8051
#  define STM32_PHYID2       MII_PHYID2_KSZ8051
#elif defined(CONFIG_ETH0_PHY_KSZ8061)
#  define STM32_PHYID1       MII_PHYID1_KSZ8061
#  define STM32_PHYID2       MII_PHYID2_KSZ8061
#elif defined(CONFIG_ETH0_PHY_KSZ8081)
#  define STM32_PHYID1       MII_PHYID1_KSZ8081
#  define STM32_PHYID2       MII_PHYID2_KSZ8081
#elif defined(CONFIG_ETH0_PHY_DP83848C)
#  define STM32_PHYID1       MII_PHYID1_DP83848C
#  define STM32_PHYID2       MII_PHYID2_DP83848C
#elif defined(CONFIG_ETH0_PHY_DP83825I)
#  define STM32_PHYID1       MII_PHYID1_DP83825I
#  define STM32_PHYID2       MII_PHYID2_DP83825I
#elif defined(CONFIG_ETH0_PHY_TJA1100)
#  define STM32_PHYID1       MII_PHYID1_TJA1100
#  define STM32_PHYID2       MII_PHYID2_TJA1100
#elif defined(CONFIG_ETH0_PHY_TJA1101)
#  define STM32_PHYID1       MII_PHYID1_TJA1101
#  define STM32_PHYID2       MII_PHYID2_TJA1101
#elif defined(CONFIG_ETH0_PHY_TJA1103)
#  define STM32_PHYID1       MII_PHYID1_TJA1103
#  define STM32_PHYID2       MII_PHYID2_TJA1103
#elif defined(CONFIG_ETH0_PHY_LAN8720)
#  define STM32_PHYID1       MII_PHYID1_LAN8720
#  define STM32_PHYID2       MII_PHYID2_LAN8720
#elif defined(CONFIG_ETH0_PHY_LAN8740)
#  define STM32_PHYID1       MII_PHYID1_LAN8740
#  define STM32_PHYID2       MII_PHYID2_LAN8740
#elif defined(CONFIG_ETH0_PHY_LAN8740A)
#  define STM32_PHYID1       MII_PHYID1_LAN8740A
#  define STM32_PHYID2       MII_PHYID2_LAN8740A
#elif defined(CONFIG_ETH0_PHY_LAN8742A)
#  define STM32_PHYID1       MII_PHYID1_LAN8742A
#  define STM32_PHYID2       MII_PHYID2_LAN8742A
#elif defined(CONFIG_ETH0_PHY_DM9161)
#  define STM32_PHYID1       MII_PHYID1_DM9161
#  define STM32_PHYID2       MII_PHYID2_DM9161
#elif defined(CONFIG_ETH0_PHY_YT8512)
#  define STM32_PHYID1       MII_PHYID1_YT8512
#  define STM32_PHYID2       MII_PHYID2_YT8512
#else
#  warning "No PHY specified!"
#endif

#ifndef CONFIG_STM32_PHYADDR
#  error "CONFIG_STM32_PHYADDR must be defined in the NuttX configuration"
#endif

#if !defined(CONFIG_STM32_MII) && !defined(CONFIG_STM32_RMII)
#  warning "Neither CONFIG_STM32_MII nor CONFIG_STM32_RMII defined"
#endif

