apache/nuttx/arch/arm/src/stm32h7/stm32_ethernet.c
  to = PHY_RESET_DELAY;
  do
    {
      up_mdelay(10);
      to -= 10;
      phyval = 0xffff;
      ret = mdio_read(priv->mdio,
        CONFIG_STM32_PHYADDR, MII_MCR, &phyval);

      ninfo("MII_MCR: phyval: %u ret: %d\n", phyval, ret);
    }
  while (phyval & MII_MCR_RESET && to > 0);

  if (to <= 0)
    {
      nerr("ERROR: Phy reset timeout\n");
      return ret;
    }
  else
    {
      ninfo("Phy reset in %d ms\n", PHY_RESET_DELAY - to);
    }

  ret = mdio_read(priv->mdio,
    CONFIG_STM32_PHYADDR, MII_PHYID1, &phyval);

  if (ret < 0)
    {
      nerr("ERROR: Failed to read PHYID1: %d\n", ret);
      return ret;
    }

  if (phyval != STM32_PHYID1)
    {
      nerr("ERROR: Incorrect PHYID1: %u expected: %u\n",
            phyval, STM32_PHYID1);
      return -ENXIO;
    }

  ninfo("MII_PHYID1: phyval: %u ret: %d\n", phyval, ret);

  ret = mdio_read(priv->mdio,
    CONFIG_STM32_PHYADDR, MII_PHYID2, &phyval);

  if (ret < 0)
    {
      nerr("ERROR: Failed to read PHYID2: %d\n", ret);
      return ret;
    }

  if ((phyval & 0xfff0) != (STM32_PHYID2 & 0xfff0))
    {
      nerr("ERROR: Incorrect PHYID2: %u expected: %u\n",
            phyval, STM32_PHYID2);
      return -ENXIO;
    }

  ninfo("MII_PHYID2: phyval: %u ret: %d\n", phyval, ret);

#ifdef CONFIG_STM32_ETHMAC_REGDEBUG
  stm32_phyregdump(priv);
#endif

  /* Special workaround for the Davicom DM9161 PHY is required. */

#ifdef CONFIG_ETH0_PHY_DM9161
  ret = stm32_dm9161(priv);
  if (ret < 0)
    {
      return ret;
    }
#endif

  /* Perform auto-negotiation if so configured */

#ifdef CONFIG_STM32_AUTONEG
  /* Wait for link status */

  for (timeout = 0; timeout < PHY_RETRY_TIMEOUT; timeout++)
    {
      ret = mdio_read(priv->mdio,
        CONFIG_STM32_PHYADDR, MII_MSR, &phyval);
      if (ret < 0)
        {
          nerr("ERROR: Failed to read the PHY MSR: %d\n", ret);
          return ret;
        }
      else if ((phyval & MII_MSR_LINKSTATUS) != 0)
        {
          ninfo("MII_MSR: phyval: %u ret: %d \n", phyval, ret);
          break;
        }

      nxsched_msleep(PHY_POLL_MS);
    }

  if (timeout >= PHY_RETRY_TIMEOUT)
    {
      nerr("ERROR: Timed out waiting for link status: %04x\n", phyval);
      return -ETIMEDOUT;
    }

#ifdef CONFIG_STM32_AUTONEG_10FD_ONLY
  /* Advertise only 10BASE-T full duplex, so that negotiation lands
   * there on both ends.  See the help text of the option for why a
   * board would want a slower link on purpose.
   */

  ret = mdio_write(priv->mdio, CONFIG_STM32_PHYADDR, MII_ADVERTISE,
                   MII_ADVERTISE_10BASETXFULL | MII_ADVERTISE_CSMA);
  if (ret < 0)
    {
      nerr("ERROR: Failed to write the PHY ANAR: %d\n", ret);
      return ret;
    }
#endif

  /* Enable and restart auto-negotiation */

  ret = mdio_write(priv->mdio,
    CONFIG_STM32_PHYADDR, MII_MCR,
    MII_MCR_ANENABLE | MII_MCR_ANRESTART);
  if (ret < 0)
    {
      nerr("ERROR: Failed to enable auto-negotiation: %d\n", ret);
      return ret;
    }

  /* Wait until auto-negotiation completes */

  for (timeout = 0; timeout < PHY_RETRY_TIMEOUT; timeout++)
    {
      ret = mdio_read(priv->mdio,
        CONFIG_STM32_PHYADDR, MII_MSR, &phyval);
      if (ret < 0)
        {
          nerr("ERROR: Failed to read the PHY MSR: %d\n", ret);
          return ret;
        }
      else if ((phyval & MII_MSR_ANEGCOMPLETE) != 0)
        {
          break;
        }

      nxsched_msleep(PHY_POLL_MS);
    }

  if (timeout >= PHY_RETRY_TIMEOUT)
    {
      nerr("ERROR: Timed out waiting for auto-negotiation\n");
      return -ETIMEDOUT;
    }

  /* Read the result of the auto-negotiation from the PHY-specific register */

  ret = mdio_read(priv->mdio,
    CONFIG_STM32_PHYADDR, CONFIG_STM32_PHYSR, &phyval);
  if (ret < 0)
    {
      nerr("ERROR: Failed to read PHY status register\n");
      return ret;
    }

  /* Remember the selected speed and duplex modes */

  ninfo("PHYSR[%d]: %04x\n", CONFIG_STM32_PHYSR, phyval);

  /* Different PHYs present speed and mode information in different ways.  IF
   * This CONFIG_STM32_PHYSR_ALTCONFIG is selected, this indicates that
   * the PHY represents speed and mode information are combined, for
   * example, with separate bits for 10HD, 100HD, 10FD and 100FD.
   */

#ifdef CONFIG_STM32_PHYSR_ALTCONFIG
  switch (phyval & CONFIG_STM32_PHYSR_ALTMODE)
    {
      default:
        nerr("ERROR: Unrecognized PHY status setting\n");

      /* Falls through */

      case CONFIG_STM32_PHYSR_10HD:
        priv->fduplex = 0;
        priv->mbps100 = 0;
        break;

      case CONFIG_STM32_PHYSR_100HD:
        priv->fduplex = 0;
        priv->mbps100 = 1;
        break;

      case CONFIG_STM32_PHYSR_10FD:
        priv->fduplex = 1;
        priv->mbps100 = 0;
        break;

      case CONFIG_STM32_PHYSR_100FD:
        priv->fduplex = 1;
        priv->mbps100 = 1;
        break;
    }

  /* Different PHYs present speed and mode information in different ways.
   * Some will present separate information for speed and mode (this is the
   * default).  Those PHYs, for example, may provide a 10/100 Mbps
   * indication and a separate full/half duplex indication.
   */

#else
  if ((phyval & CONFIG_STM32_PHYSR_MODE) ==
      CONFIG_STM32_PHYSR_FULLDUPLEX)
    {
      priv->fduplex = 1;
    }

  if ((phyval & CONFIG_STM32_PHYSR_SPEED) == CONFIG_STM32_PHYSR_100MBPS)
    {
      priv->mbps100 = 1;
    }
#endif

#else /* Auto-negotiation not selected */

  phyval = 0;
#ifdef CONFIG_STM32_ETHFD
  phyval |= MII_MCR_FULLDPLX;
#endif
#ifdef CONFIG_STM32_ETH100MBPS
  phyval |= MII_MCR_SPEED100;
#endif

  /* mdio_write, not stm32_phywrite:  this driver never had the latter.
   * The call was carried over from the F7 driver and nothing had ever
   * built this path.
   */

  ret = mdio_write(priv->mdio, CONFIG_STM32_PHYADDR, MII_MCR, phyval);
  if (ret < 0)
    {
      nerr("ERROR: Failed to write the PHY MCR: %d\n", ret);
      return ret;
    }

  up_mdelay(PHY_CONFIG_DELAY);

  /* Remember the selected speed and duplex modes */

